# Importing Libraries and Files

In [1]:
# Importing Libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Importing products csv
path = r'/Users/melanie/Desktop/7:2022 Instacart Basket Analysis'

In [3]:
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
# Importing orders wrangled csv
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# Exercise 4.5

In [5]:
# Create a dataframe
df_test = pd.DataFrame()

In [6]:
# Create a mixed type column
df_test['mix'] = ['a','b',1, True]

In [7]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [8]:
# Check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [9]:
df_test['mix'] = df_test['mix'].astype('str')

In [10]:
# Checking for mixed types in product csv
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

In [11]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
# Create a subset df_nan
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [13]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
df_prods.shape

(49693, 5)

In [15]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [16]:
df_prods_clean.shape

(49677, 5)

In [17]:
# Looking for duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [20]:
df_prods_clean_no_dups.shape

(49672, 5)

In [21]:
# Exporting as csv file
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Data','Prepared Data', 'products_checked.csv'))

# Task 4.5

In [22]:
# Looking for off values in df_prods
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

Values look good. Nothing looks off.

In [23]:
# Checking for mixed-type data in df_prods
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

In [24]:
# Fixing the mixed-type data, product_name column
df_prods['product_name'] = df_prods['product_name'].astype('str')

In [25]:
# Finding missing values in df_prods
df_prods.isnull().sum()

product_id       0
product_name     0
aisle_id         0
department_id    0
prices           0
dtype: int64

There are 0 missing values within the products csv file.

In [26]:
# Looking for duplicates in df_prods
df_dups = df_prods[df_prods.duplicated()]

In [27]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [28]:
# Before dropping duplicate values
df_prods.shape

(49693, 5)

In [29]:
# Dropping the duplicates from df_prods
df_prods_no_dups = df_prods.drop_duplicates()

In [30]:
df_prods_no_dups.shape

(49688, 5)

Five rows were dropped as duplicates.

In [31]:
# Looking for off values in df_ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

The unnamed column looks to be a repeat column of the order_id. We can drop this column.

In [32]:
# Dropping Unnamed column from orders wrangled csv
df_ords.drop(columns = {'Unnamed: 0'})

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [33]:
# Renaming as df_ords_2
df_ords_2 = df_ords.drop(columns = {'Unnamed: 0'})

In [34]:
df_ords_2

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [35]:
# Check for mixed types in df_ords_2

for col in df_ords_2.columns.tolist():
  weird = (df_ords_2[[col]].applymap(type) != df_ords_2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords_2[weird]) > 0:
    print (col)

No columns were named as mixed types.

In [36]:
# Looking for missing values in df_ords_2
df_ords_2.isnull().sum()

order_id                          0
user_id                           0
order_number                      0
orders_day_of_week                0
order_hour_of_day                 0
days_since_previous_order    206209
dtype: int64

In [37]:
# Creating a subset to view only NaN values from days_since_previous_order
df_nan_ords = df_ords_2[df_ords_2['days_since_previous_order'].isnull() == True]

In [38]:
df_nan_ords

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [39]:
# Replacing Nan values with median value
df_ords_2.median()

order_id                     1710542.0
user_id                       102689.0
order_number                      11.0
orders_day_of_week                 3.0
order_hour_of_day                 13.0
days_since_previous_order          7.0
dtype: float64

In [40]:
# df_ords_2['days_since_previous_order'].fillna(8)

In [41]:
# df_ords_2['days_since_previous_order'] = df_ords_2['days_since_previous_order'].fillna(8)

In [42]:
print(df_ords_2['days_since_previous_order'])

0           NaN
1          15.0
2          21.0
3          29.0
4          28.0
           ...
3421078    29.0
3421079    30.0
3421080    18.0
3421081     7.0
3421082    30.0
Name: days_since_previous_order, Length: 3421083, dtype: float64

In [43]:
print(df_ords_2)

         order_id  user_id  order_number  orders_day_of_week  \
0         2539329        1             1                   2
1         2398795        1             2                   3
2          473747        1             3                   3
3         2254736        1             4                   4
4          431534        1             5                   4
...           ...      ...           ...                 ...
3421078   2266710   206209            10                   5
3421079   1854736   206209            11                   4
3421080    626363   206209            12                   1
3421081   2977660   206209            13                   1
3421082    272231   206209            14                   6

         order_hour_of_day  days_since_previous_order
0                        8                        NaN
1                        7                       15.0
2                       12                       21.0
3                        7                       29.0
4                       15                       28.0
...                    ...                        ...
3421078                 18                       29.0
3421079                 10                       30.0
3421080                 12                       18.0
3421081                 12                        7.0
3421082                 14                       30.0

[3421083 rows x 6 columns]

# I chose to replace the NaN values with the median because I felt like this would give more appropriate values to the data.

In [44]:
# Looking for duplicates in df_ords_2
df_dups_ords = df_ords_2[df_ords_2.duplicated()]

In [45]:
df_dups_ords

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_previous_order]
Index: []

No duplicates found in the orders csv.

In [46]:
# Exporting df_prods_no_dups
df_prods_no_dups.to_csv(os.path.join(path, 'Data','Prepared Data', 'products_checked.csv'))

In [47]:
# Exporting df_ords_2
df_ords_2.to_csv(os.path.join(path, 'Data','Prepared Data', 'orders_checked.csv'))